liyinuoman2017/gateway/gateway/source/button_task/button_bsp_hc32f64.c
/**
*********************************************************************************************************
*                                        multi_switch_control
*                                      (c) Copyright 2021-2031
*                                         All Rights Reserved
*
* @File    : 
* @By      : liwei
* @Version : V0.01
* BSP层只处理简单的IO操作，不负责逻辑控制
*********************************************************************************************************
**/

/*
*********************************************************************************************************
Includes 
*********************************************************************************************************
*/
#include "user_type.h"
#include "button_bsp_hc32f64.h"
#include "hc32f46x_gpio.h"
/*
*********************************************************************************************************
Define
*********************************************************************************************************
*/
/*  Port definition */
#define  BUTTON_PORT         (PortC)
/* Pin definition */
#define  BUTTON0_PIN         (Pin00)
#define  BUTTON1_PIN         (Pin01)
#define  BUTTON2_PIN         (Pin02)
#define  BUTTON3_PIN         (Pin03)
#define  BUTTON4_PIN         (Pin04)
#define  BUTTON5_PIN         (Pin05)
#define  BUTTON6_PIN         (Pin06)
#define  BUTTON7_PIN         (Pin07)


static en_pin_t uesr_pin_buff[8]=
{
	BUTTON0_PIN,
	BUTTON1_PIN,
	BUTTON2_PIN,
	BUTTON3_PIN,
	BUTTON4_PIN,
	BUTTON5_PIN,
	BUTTON6_PIN,	
	BUTTON7_PIN	
};

/*
*********************************************************************************************************
Typedef
*********************************************************************************************************
*/

/*
*********************************************************************************************************
Variables
*********************************************************************************************************
*/

/*
*********************************************************************************************************
Function 
*********************************************************************************************************
*/

static u8 read(data_stream_t* stream_in, u8* parameter);
static u8 write(data_stream_t* stream_in, u8* parameter);
static u8 initialization(data_stream_t* stream_in, u8* parameter);
static u8 interrput(data_stream_t* stream_in, u8* parameter);
static u8 run(data_stream_t* stream_in, u8* parameter);

/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/
interface_template_t button_bsp_internface=
{
	.read=&read,
	.write=&write,
	.initialization=&initialization,
	.interrput=&interrput,
	.run=&run,
};
/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/

static u8 read(data_stream_t* stream_in, u8* parameter)
{
	u8 i;
	if(stream_in->cmd < 8)
		i =  PORT_GetBit(BUTTON_PORT, uesr_pin_buff[stream_in->cmd]);

	return i;
}
/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/
static u8 write(data_stream_t* stream_in, u8* parameter)
{
	return 0;
}
/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/
static u8 initialization(data_stream_t* stream_in, u8* parameter)
{
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcPortInit);

    stcPortInit.enPinMode = Pin_Mode_In;
    stcPortInit.enExInt = Enable;
    stcPortInit.enPullUp = Enable;

    /* LED0 Port/Pin initialization */
    PORT_Init(BUTTON_PORT, BUTTON0_PIN|BUTTON1_PIN|BUTTON2_PIN|BUTTON3_PIN|BUTTON4_PIN|BUTTON5_PIN|BUTTON6_PIN|BUTTON7_PIN, &stcPortInit);
	
	return 0;
}
/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/
static u8 interrput(data_stream_t* stream_in, u8* parameter)
{

	return 0;
}
/**
*********************************************************************************************************
* @名称	: 
* @描述	: 
* @参数	: 
* @返回	: 
*********************************************************************************************************
**/
static u8 run(data_stream_t* stream_in, u8* parameter)
{
	return 0;
}

/***********************************************END*****************************************************/

